SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_smu.h
/* Bit fields for SMU STATUS */
#define _SMU_STATUS_RESETVALUE                  0x00000000UL                            /**< Default value for SMU_STATUS                */
#define _SMU_STATUS_MASK                        0x00000003UL                            /**< Mask for SMU_STATUS                         */
#define SMU_STATUS_SMULOCK                      (0x1UL << 0)                            /**< SMU Lock                                    */
#define _SMU_STATUS_SMULOCK_SHIFT               0                                       /**< Shift value for SMU_SMULOCK                 */
#define _SMU_STATUS_SMULOCK_MASK                0x1UL                                   /**< Bit mask for SMU_SMULOCK                    */
#define _SMU_STATUS_SMULOCK_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for SMU_STATUS                 */
#define _SMU_STATUS_SMULOCK_UNLOCKED            0x00000000UL                            /**< Mode UNLOCKED for SMU_STATUS                */
#define _SMU_STATUS_SMULOCK_LOCKED              0x00000001UL                            /**< Mode LOCKED for SMU_STATUS                  */
#define SMU_STATUS_SMULOCK_DEFAULT              (_SMU_STATUS_SMULOCK_DEFAULT << 0)      /**< Shifted mode DEFAULT for SMU_STATUS         */
#define SMU_STATUS_SMULOCK_UNLOCKED             (_SMU_STATUS_SMULOCK_UNLOCKED << 0)     /**< Shifted mode UNLOCKED for SMU_STATUS        */
#define SMU_STATUS_SMULOCK_LOCKED               (_SMU_STATUS_SMULOCK_LOCKED << 0)       /**< Shifted mode LOCKED for SMU_STATUS          */
#define SMU_STATUS_SMUPRGERR                    (0x1UL << 1)                            /**< SMU Programming Error                       */
#define _SMU_STATUS_SMUPRGERR_SHIFT             1                                       /**< Shift value for SMU_SMUPRGERR               */
#define _SMU_STATUS_SMUPRGERR_MASK              0x2UL                                   /**< Bit mask for SMU_SMUPRGERR                  */
#define _SMU_STATUS_SMUPRGERR_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMU_STATUS                 */
#define SMU_STATUS_SMUPRGERR_DEFAULT            (_SMU_STATUS_SMUPRGERR_DEFAULT << 1)    /**< Shifted mode DEFAULT for SMU_STATUS         */

/* Bit fields for SMU LOCK */
#define _SMU_LOCK_RESETVALUE                    0x00000000UL                            /**< Default value for SMU_LOCK                  */
#define _SMU_LOCK_MASK                          0x00FFFFFFUL                            /**< Mask for SMU_LOCK                           */
#define _SMU_LOCK_SMULOCKKEY_SHIFT              0                                       /**< Shift value for SMU_SMULOCKKEY              */
#define _SMU_LOCK_SMULOCKKEY_MASK               0xFFFFFFUL                              /**< Bit mask for SMU_SMULOCKKEY                 */
#define _SMU_LOCK_SMULOCKKEY_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMU_LOCK                   */
#define _SMU_LOCK_SMULOCKKEY_UNLOCK             0x00ACCE55UL                            /**< Mode UNLOCK for SMU_LOCK                    */
#define SMU_LOCK_SMULOCKKEY_DEFAULT             (_SMU_LOCK_SMULOCKKEY_DEFAULT << 0)     /**< Shifted mode DEFAULT for SMU_LOCK           */
#define SMU_LOCK_SMULOCKKEY_UNLOCK              (_SMU_LOCK_SMULOCKKEY_UNLOCK << 0)      /**< Shifted mode UNLOCK for SMU_LOCK            */

/* Bit fields for SMU IF */
#define _SMU_IF_RESETVALUE                      0x00000000UL                            /**< Default value for SMU_IF                    */
#define _SMU_IF_MASK                            0x00030005UL                            /**< Mask for SMU_IF                             */
#define SMU_IF_PPUPRIV                          (0x1UL << 0)                            /**< PPU Privilege Interrupt Flag                */
#define _SMU_IF_PPUPRIV_SHIFT                   0                                       /**< Shift value for SMU_PPUPRIV                 */
#define _SMU_IF_PPUPRIV_MASK                    0x1UL                                   /**< Bit mask for SMU_PPUPRIV                    */
#define _SMU_IF_PPUPRIV_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for SMU_IF                     */
#define SMU_IF_PPUPRIV_DEFAULT                  (_SMU_IF_PPUPRIV_DEFAULT << 0)          /**< Shifted mode DEFAULT for SMU_IF             */
#define SMU_IF_PPUINST                          (0x1UL << 2)                            /**< PPU Instruction Interrupt Flag              */
#define _SMU_IF_PPUINST_SHIFT                   2                                       /**< Shift value for SMU_PPUINST                 */
#define _SMU_IF_PPUINST_MASK                    0x4UL                                   /**< Bit mask for SMU_PPUINST                    */
#define _SMU_IF_PPUINST_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for SMU_IF                     */
#define SMU_IF_PPUINST_DEFAULT                  (_SMU_IF_PPUINST_DEFAULT << 2)          /**< Shifted mode DEFAULT for SMU_IF             */
#define SMU_IF_PPUSEC                           (0x1UL << 16)                           /**< PPU Security Interrupt Flag                 */
#define _SMU_IF_PPUSEC_SHIFT                    16                                      /**< Shift value for SMU_PPUSEC                  */
#define _SMU_IF_PPUSEC_MASK                     0x10000UL                               /**< Bit mask for SMU_PPUSEC                     */
#define _SMU_IF_PPUSEC_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for SMU_IF                     */
#define SMU_IF_PPUSEC_DEFAULT                   (_SMU_IF_PPUSEC_DEFAULT << 16)          /**< Shifted mode DEFAULT for SMU_IF             */
#define SMU_IF_BMPUSEC                          (0x1UL << 17)                           /**< BMPU Security Interrupt Flag                */
#define _SMU_IF_BMPUSEC_SHIFT                   17                                      /**< Shift value for SMU_BMPUSEC                 */
#define _SMU_IF_BMPUSEC_MASK                    0x20000UL                               /**< Bit mask for SMU_BMPUSEC                    */
#define _SMU_IF_BMPUSEC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for SMU_IF                     */
#define SMU_IF_BMPUSEC_DEFAULT                  (_SMU_IF_BMPUSEC_DEFAULT << 17)         /**< Shifted mode DEFAULT for SMU_IF             */

/* Bit fields for SMU IEN */
#define _SMU_IEN_RESETVALUE                     0x00000000UL                            /**< Default value for SMU_IEN                   */
#define _SMU_IEN_MASK                           0x00030005UL                            /**< Mask for SMU_IEN                            */
#define SMU_IEN_PPUPRIV                         (0x1UL << 0)                            /**< PPU Privilege Interrupt Enable              */
#define _SMU_IEN_PPUPRIV_SHIFT                  0                                       /**< Shift value for SMU_PPUPRIV                 */
#define _SMU_IEN_PPUPRIV_MASK                   0x1UL                                   /**< Bit mask for SMU_PPUPRIV                    */
#define _SMU_IEN_PPUPRIV_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for SMU_IEN                    */
#define SMU_IEN_PPUPRIV_DEFAULT                 (_SMU_IEN_PPUPRIV_DEFAULT << 0)         /**< Shifted mode DEFAULT for SMU_IEN            */
#define SMU_IEN_PPUINST                         (0x1UL << 2)                            /**< PPU Instruction Interrupt Enable            */
#define _SMU_IEN_PPUINST_SHIFT                  2                                       /**< Shift value for SMU_PPUINST                 */
#define _SMU_IEN_PPUINST_MASK                   0x4UL                                   /**< Bit mask for SMU_PPUINST                    */
#define _SMU_IEN_PPUINST_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for SMU_IEN                    */
#define SMU_IEN_PPUINST_DEFAULT                 (_SMU_IEN_PPUINST_DEFAULT << 2)         /**< Shifted mode DEFAULT for SMU_IEN            */
#define SMU_IEN_PPUSEC                          (0x1UL << 16)                           /**< PPU Security Interrupt Enable               */
#define _SMU_IEN_PPUSEC_SHIFT                   16                                      /**< Shift value for SMU_PPUSEC                  */
#define _SMU_IEN_PPUSEC_MASK                    0x10000UL                               /**< Bit mask for SMU_PPUSEC                     */
#define _SMU_IEN_PPUSEC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for SMU_IEN                    */
#define SMU_IEN_PPUSEC_DEFAULT                  (_SMU_IEN_PPUSEC_DEFAULT << 16)         /**< Shifted mode DEFAULT for SMU_IEN            */
#define SMU_IEN_BMPUSEC                         (0x1UL << 17)                           /**< BMPU Security Interrupt Enable              */
#define _SMU_IEN_BMPUSEC_SHIFT                  17                                      /**< Shift value for SMU_BMPUSEC                 */
#define _SMU_IEN_BMPUSEC_MASK                   0x20000UL                               /**< Bit mask for SMU_BMPUSEC                    */
#define _SMU_IEN_BMPUSEC_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for SMU_IEN                    */
#define SMU_IEN_BMPUSEC_DEFAULT                 (_SMU_IEN_BMPUSEC_DEFAULT << 17)        /**< Shifted mode DEFAULT for SMU_IEN            */

/* Bit fields for SMU M33CTRL */
#define _SMU_M33CTRL_RESETVALUE                 0x00000000UL                            /**< Default value for SMU_M33CTRL               */
#define _SMU_M33CTRL_MASK                       0x0000001FUL                            /**< Mask for SMU_M33CTRL                        */
#define SMU_M33CTRL_LOCKSVTAIRCR                (0x1UL << 0)                            /**< New BitField                                */
#define _SMU_M33CTRL_LOCKSVTAIRCR_SHIFT         0                                       /**< Shift value for SMU_LOCKSVTAIRCR            */
#define _SMU_M33CTRL_LOCKSVTAIRCR_MASK          0x1UL                                   /**< Bit mask for SMU_LOCKSVTAIRCR               */
#define _SMU_M33CTRL_LOCKSVTAIRCR_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for SMU_M33CTRL                */
#define SMU_M33CTRL_LOCKSVTAIRCR_DEFAULT        (_SMU_M33CTRL_LOCKSVTAIRCR_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_M33CTRL        */
#define SMU_M33CTRL_LOCKNSVTOR                  (0x1UL << 1)                            /**< New BitField                                */
#define _SMU_M33CTRL_LOCKNSVTOR_SHIFT           1                                       /**< Shift value for SMU_LOCKNSVTOR              */
#define _SMU_M33CTRL_LOCKNSVTOR_MASK            0x2UL                                   /**< Bit mask for SMU_LOCKNSVTOR                 */
#define _SMU_M33CTRL_LOCKNSVTOR_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for SMU_M33CTRL                */
#define SMU_M33CTRL_LOCKNSVTOR_DEFAULT          (_SMU_M33CTRL_LOCKNSVTOR_DEFAULT << 1)  /**< Shifted mode DEFAULT for SMU_M33CTRL        */
#define SMU_M33CTRL_LOCKSMPU                    (0x1UL << 2)                            /**< New BitField                                */
#define _SMU_M33CTRL_LOCKSMPU_SHIFT             2                                       /**< Shift value for SMU_LOCKSMPU                */
#define _SMU_M33CTRL_LOCKSMPU_MASK              0x4UL                                   /**< Bit mask for SMU_LOCKSMPU                   */
#define _SMU_M33CTRL_LOCKSMPU_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMU_M33CTRL                */
#define SMU_M33CTRL_LOCKSMPU_DEFAULT            (_SMU_M33CTRL_LOCKSMPU_DEFAULT << 2)    /**< Shifted mode DEFAULT for SMU_M33CTRL        */
#define SMU_M33CTRL_LOCKNSMPU                   (0x1UL << 3)                            /**< New BitField                                */
#define _SMU_M33CTRL_LOCKNSMPU_SHIFT            3                                       /**< Shift value for SMU_LOCKNSMPU               */
#define _SMU_M33CTRL_LOCKNSMPU_MASK             0x8UL                                   /**< Bit mask for SMU_LOCKNSMPU                  */
#define _SMU_M33CTRL_LOCKNSMPU_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for SMU_M33CTRL                */
#define SMU_M33CTRL_LOCKNSMPU_DEFAULT           (_SMU_M33CTRL_LOCKNSMPU_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMU_M33CTRL        */
#define SMU_M33CTRL_LOCKSAU                     (0x1UL << 4)                            /**< New BitField                                */
#define _SMU_M33CTRL_LOCKSAU_SHIFT              4                                       /**< Shift value for SMU_LOCKSAU                 */
#define _SMU_M33CTRL_LOCKSAU_MASK               0x10UL                                  /**< Bit mask for SMU_LOCKSAU                    */
#define _SMU_M33CTRL_LOCKSAU_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMU_M33CTRL                */
#define SMU_M33CTRL_LOCKSAU_DEFAULT             (_SMU_M33CTRL_LOCKSAU_DEFAULT << 4)     /**< Shifted mode DEFAULT for SMU_M33CTRL        */

