SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_smu.h
/* Bit fields for SMU ESAUMRB45 */
#define _SMU_ESAUMRB45_RESETVALUE               0x02000000UL                            /**< Default value for SMU_ESAUMRB45             */
#define _SMU_ESAUMRB45_MASK                     0x0FFFF000UL                            /**< Mask for SMU_ESAUMRB45                      */
#define _SMU_ESAUMRB45_ESAUMRB45_SHIFT          12                                      /**< Shift value for SMU_ESAUMRB45               */
#define _SMU_ESAUMRB45_ESAUMRB45_MASK           0xFFFF000UL                             /**< Bit mask for SMU_ESAUMRB45                  */
#define _SMU_ESAUMRB45_ESAUMRB45_DEFAULT        0x00002000UL                            /**< Mode DEFAULT for SMU_ESAUMRB45              */
#define SMU_ESAUMRB45_ESAUMRB45_DEFAULT         (_SMU_ESAUMRB45_ESAUMRB45_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAUMRB45      */

/* Bit fields for SMU ESAUMRB56 */
#define _SMU_ESAUMRB56_RESETVALUE               0x04000000UL                            /**< Default value for SMU_ESAUMRB56             */
#define _SMU_ESAUMRB56_MASK                     0x0FFFF000UL                            /**< Mask for SMU_ESAUMRB56                      */
#define _SMU_ESAUMRB56_ESAUMRB56_SHIFT          12                                      /**< Shift value for SMU_ESAUMRB56               */
#define _SMU_ESAUMRB56_ESAUMRB56_MASK           0xFFFF000UL                             /**< Bit mask for SMU_ESAUMRB56                  */
#define _SMU_ESAUMRB56_ESAUMRB56_DEFAULT        0x00004000UL                            /**< Mode DEFAULT for SMU_ESAUMRB56              */
#define SMU_ESAUMRB56_ESAUMRB56_DEFAULT         (_SMU_ESAUMRB56_ESAUMRB56_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAUMRB56      */

/** @} End of group EFR32SG28_SMU_BitFields */
/** @} End of group EFR32SG28_SMU */
/**************************************************************************//**
 * @defgroup EFR32SG28_SMU_CFGNS SMU_CFGNS
 * @{
 * @brief EFR32SG28 SMU_CFGNS Register Declaration.
 *****************************************************************************/

/** SMU_CFGNS Register Declaration. */
typedef struct
{
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS;               /**< Status Register                                    */
  __IOM uint32_t             NSLOCK;                 /**< Lock Register                                      */
  __IOM uint32_t             NSIF;                   /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN;                  /**< Interrupt Enable Register                          */
        uint32_t             RESERVED1[3U];          /**< Reserved for future use                            */
        uint32_t             RESERVED2[8U];     /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0;             /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1;             /**< Privileged Access                                  */
        uint32_t             RESERVED3[62U];         /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS;                /**< Fault Status                                       */
        uint32_t             RESERVED4[3U];     /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0;            /**< Privileged Attribute                               */
        uint32_t             RESERVED5[63U];         /**< Reserved for future use                            */
        uint32_t             RESERVED6[876U];   /**< Reserved for future use                            */
        uint32_t             RESERVED7[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS_SET;           /**< Status Register                                    */
  __IOM uint32_t             NSLOCK_SET;             /**< Lock Register                                      */
  __IOM uint32_t             NSIF_SET;               /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN_SET;              /**< Interrupt Enable Register                          */
        uint32_t             RESERVED8[3U];          /**< Reserved for future use                            */
        uint32_t             RESERVED9[8U];     /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0_SET;         /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1_SET;         /**< Privileged Access                                  */
        uint32_t             RESERVED10[62U];        /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS_SET;            /**< Fault Status                                       */
        uint32_t             RESERVED11[3U];    /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0_SET;        /**< Privileged Attribute                               */
        uint32_t             RESERVED12[63U];        /**< Reserved for future use                            */
        uint32_t             RESERVED13[876U];  /**< Reserved for future use                            */
        uint32_t             RESERVED14[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS_CLR;           /**< Status Register                                    */
  __IOM uint32_t             NSLOCK_CLR;             /**< Lock Register                                      */
  __IOM uint32_t             NSIF_CLR;               /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN_CLR;              /**< Interrupt Enable Register                          */
        uint32_t             RESERVED15[3U];         /**< Reserved for future use                            */
        uint32_t             RESERVED16[8U];    /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0_CLR;         /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1_CLR;         /**< Privileged Access                                  */
        uint32_t             RESERVED17[62U];        /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS_CLR;            /**< Fault Status                                       */
        uint32_t             RESERVED18[3U];    /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0_CLR;        /**< Privileged Attribute                               */
        uint32_t             RESERVED19[63U];        /**< Reserved for future use                            */
        uint32_t             RESERVED20[876U];  /**< Reserved for future use                            */
        uint32_t             RESERVED21[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             NSSTATUS_TGL;           /**< Status Register                                    */
  __IOM uint32_t             NSLOCK_TGL;             /**< Lock Register                                      */
  __IOM uint32_t             NSIF_TGL;               /**< Interrupt Flag Register                            */
  __IOM uint32_t             NSIEN_TGL;              /**< Interrupt Enable Register                          */
        uint32_t             RESERVED22[3U];         /**< Reserved for future use                            */
        uint32_t             RESERVED23[8U];    /**< Reserved for future use                            */
  __IOM uint32_t             PPUNSPATD0_TGL;         /**< Privileged Access                                  */
  __IOM uint32_t             PPUNSPATD1_TGL;         /**< Privileged Access                                  */
        uint32_t             RESERVED24[62U];        /**< Reserved for future use                            */
  __IM  uint32_t             PPUNSFS_TGL;            /**< Fault Status                                       */
        uint32_t             RESERVED25[3U];    /**< Reserved for future use                            */
  __IOM uint32_t             BMPUNSPATD0_TGL;        /**< Privileged Attribute                               */
        uint32_t             RESERVED26[63U];        /**< Reserved for future use                            */
} SMU_CFGNS_TypeDef;
